2D_jet_flame/constant/gas/thermophysicalTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
 FoamFile
 {
     format      ascii;
     class       dictionary;
     location    "constant";
     object      thermophysicalTransport;
 }
 // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

laminar
{
    model               mixtureAveraged;
    implicitHeatFlux    true;
    DmLimit             1e-6;

    mixtureDiffusionCoefficients no;

    D // [m^2/s]
    {
        #include "binaryDiffusionCoefficientsPolynomialDict"
    }
}

 // ************************************************************************* //
