2D_jet_flame/system/sampleFn
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
libs            ( "libsampling.so" );

type            sets;

region          gas;

setFormat       raw;

interpolationScheme cellPoint;

writeControl    outputTime;

sets
(
    R_x1
    {
        type            lineUniform;
        nPoints         101;
        axis            distance;
        start           ( 0.001 0 0 );
        end             ( 0.001 0.01 0 );
    }
    R_x5
    {
        type            lineUniform;
        nPoints         101;
        axis            distance;
        start           ( 0.005 0 0 );
        end             ( 0.005 0.01 0 );
    }
    R_x25
    {
        type            lineUniform;
        nPoints         101;
        axis            distance;
        start           ( 0.025 0 0 );
        end             ( 0.025 0.01 0 );
    }
    R_x50
    {
        type            lineUniform;
        nPoints         101;
        axis            distance;
        start           ( 0.050 0 0 );
        end             ( 0.050 0.01 0 );
    }
    ax
    {
        type            lineUniform;
        nPoints         111;
        axis            distance;
        start           ( 0 0 0 );
        end             ( 0.110 0 0 );
    }
    inlet
    {
        type            lineUniform;
        nPoints         101;
        axis            distance;
        start           ( 0 0 0 );
        end             ( 0 0.0005 0 );
    }
);

fields          ( H2 H2O N2 O2 OH T U );


// ************************************************************************* //
