2D_jet_flame/Allmesh
#!/bin/bash -e

blockMesh
splitMeshRegions -cellZonesOnly -overwrite
topoSet -region gas
